#+options: H:1
#+latex_class: beamer
#+columns: %45ITEM %10BEAMER_env(Env) %10BEAMER_act(Act) %4BEAMER_col(Col) %8BEAMER_opt(Opt)
#+beamer_theme: Madrid
#+beamer_color_theme:
#+beamer_font_theme:
#+beamer_inner_theme:
#+beamer_outer_theme:
#+beamer_header:
#+TITLE: POLIMI/ONERA SBW Model

* Boilerplate src
#+name: pd2org
#+begin_src python :var df="df" :exports none
  return f"return tabulate({df}, headers={df}.columns, tablefmt='orgtbl')"
#+end_src

#+RESULTS: pd2org
: return tabulate(df, headers=df.columns, tablefmt='orgtbl')

#+name: savefig
#+begin_src python :var figname="plot.svg" width=5 height=5 :exports none
  return f"""plt.savefig('{figname}')
  '{figname}'"""
#+end_src

#+RESULTS: savefig
: plt.savefig('plot.svg')
: 'plot.svg'

* COMMENT Calculator :noexport:

#+BEGIN_SRC calc
fsolve([x + y = a, x - y = b],[x,y])
#+END_SRC

#+RESULTS:
: [x = a + (b - a) / 2, y = (a - b) / 2]

#+BEGIN_SRC calc :var x=5 :var y=2
2+a*x**y
#+END_SRC

#+RESULTS:
: 25 a + 2

#+HEADERS: :includes <math.h> :flags -lm 
#+HEADERS: :var x=1.0 :var y=4.0 :var z=10.0
#+BEGIN_SRC C 
  double pi = 4*atan(1);
  double r, theta, phi;
  r = sqrt(x*x+y*y+z*z);
  theta = acos(z/r);
  phi = atan2(y,x);
  printf("%f %f %f", r, theta, phi);
#+END_SRC

#+RESULTS:
: 10.816654 0.391074 1.325818

#+RESULTS: blockA
: I am blockA

#+NAME: a-name 
#+BEGIN_SRC python :var name=(org-element-property :name (org-element-context)) :results output
  print(name)
#+END_SRC

#+RESULTS: a-name
: a-name

#+begin_src python :session py1 :results value file  :exports results :var name=(org-element-property :name (org-element-context))
  fig1 = f"./img/{name}.png"
  results["shift_panelsLM30_0.0"]['sol145'].obj.plot_vg_vf(modes=range(1, 15),
                                                           ylim_damping=[-0.15, 0.03],
                                                           ylim_freq=[0.75, 5],
                                                           legend=False)
  <<savefig(figname=fig1)>>
  #+end_src
